var card = new Vue({
	el:'#exampleModal',
	data:{
		courseName: '程式設計',
		imgUrl:'https://datasciencebe.files.wordpress.com/2015/01/coursera.png',
		Info:'電腦程式設計（英語：Computer programming），或稱程式設計（programming），是給出解決特定問題程式的過程，軟體開發過程中的重要步驟。程式設計往往以某種程式設計語言為工具，給出這種語言下的程式。程式設計過程應包括分析、設計、編碼、測試、除錯等不同階段。<br />'+
			'在電腦技術發展的早期，軟體開發主要就是程式設計。但隨著技術的發展，軟體系統越來越複雜，逐漸分化出許多專用的軟體系統，如作業系統、資料庫系統、應用伺服器，而且這些專用的軟體系統愈來愈成為普遍的系統環境的一部分。這種情況下軟體開發的內容越來越豐富，不再只是純粹的程式設計，還包括資料庫設計、使用者介面設計、通訊協定設計和複雜的系統配置過程。<br />'+
			'專業的程式設計人員被稱為程式設計師。某種意思上，程式設計的出現甚至早於電子電腦的出現。英國著名詩人拜倫的女兒愛達·勒芙蕾絲曾設計了巴貝奇分析機上計算伯努利數的一個程式。她甚至還建立了迴圈和子程式的概念。由於她在程式設計上的突破性創新，愛達·勒芙蕾絲被稱為世界上第一位程式設計師。<br />'+
			'任何設計工作都是在各種條件限制和相互矛盾的需求之間尋求一種平衡。這種觀點反映在程式設計上，就是硬體儲存空間與程式執行時間的限制。',
		slogan:'"想當初就是這樣一路辛苦學會程式的啊！但現在回頭一看，一切都是值得的！"',
	}
});
