/*empty now*/

var story1 = new Vue({
	el:'.modal-content',
	data:{
		storyTitle:'這樣點名也行...',
		text:'誠徵 106-2 的「商管程式設計」助教一位～～<br />'+
			'1. 這是七位助教的其中一位，其他六位已經找好了，都是資管所碩一或碩二的學生，有意應徵的同學可以問我。<br />'+
			'2. 工作不算輕鬆：輪流週一早上跟課、週三或週四晚上帶實習、輪流週五開 office hour、分攤作業與考試測試資料設計，以及其他雜七雜八任務<br />'+
			'3. 待遇相當普通：一學期標準價 22500<br />'+
			'4. 課程內容與進行方式與 http://www.im.ntu.edu.tw/~lckung/courses/PBC17/ 大同小異<br />'+
			'5. 修課同學以不具程式基礎的同學為主，所以即使不懂 Python，只要有臺大資管系高年級或資管所一般同學的程度，跟著學也就很夠了。<br />'+
			'6. 重點是要有耐心，以及分享知識的教育熱忱～～<br />'+
			'7. 用 Mac 者尤佳，因為會有很多同學有電腦安裝、設定、操作上的問題，但我自己是用 Windows，所以需要助教來協助使用 Mac 的（許多）同學。<br />'+
			'請有興趣的同學聯絡我吧，不是資管系或不是研究所的也可以聯絡我，我會看情況安排。謝謝～～',
	}
});